todos_app_rails/app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test6"], ["body", "test6"], ["created_at", "2018-12-05 00:27:47.302654"], ["updated_at", "2018-12-05 00:27:47.302654"]]